0001/** New Program EX01.
0002/**
0003/** :author eduar
0004/* TODO Enter your code here
0005DEFINE DATA LOCAL
00061 VM VIEW OF CVMT-VEICULO
0007    2 VE-ANO-FABRIC-VEIC
0008    2 VE-ANO-MOD-VEIC
0009    2 VE-COD-CARROC-VEIC
0010END-DEFINE
0011*
0012READ (10) VM
0013    DISPLAY VW
0014END-READ
0015*
0016END
