0001/** New Program PRG01.
0002/**
0003/** :author eduar
0004/* TODO Enter your code here
0005DEFINE DATA LOCAL
00061 VW VIEW OF CFPP-CAD-PESSOAL
0007    2 CP-SELECIONADOR
0008    2 CP-LETRA-NOME
0009    2 CP-NUM-SEQ-MAT
0010END-DEFINE
0011*
0012READ (10) VM
0013    DISPLAY CP-SELECIONADOR CP-LETRA-NOME CP-NUM-SEQ-MAT    
0014END-READ
0015*
0016END
