0001/** New Program PLUS_TWO.
0002/**
0003/** :author eduar
0004/* TODO Enter your code here
0005define data local
00061 n1 (n2)
00071 n2 (n2)
00081 soma (n3)
0009end-define
0010
0011write 'Digie um numero' input n1 
0012write 'Digie outro numero' input n2
0013
0014soma := n1 + n2
0015
0016write 'N1 = ' n1 / 'N2 = ' n2 / 'Total' soma
0017
0018
0019END
