* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program EXE21.
/**
/** :author eduar
/* TODO Enter your code here
DEFINE DATA LOCAL
1 teste view of CFPP-TB-CONTROLES
END-DEFINE

END
